recipes/simple-pasta-bake.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Simple pasta bake</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content" class="content">
<h1 class="title">Simple pasta bake</h1>
<p>
<a href="https://www.jaroflemons.com/vegan-pasta-bake/#wprm-recipe-container-145252">Original link</a>
</p>

<div id="outline-container-org1a57906" class="outline-2">
<h2 id="org1a57906">Ingredients</h2>
<div class="outline-text-2" id="text-org1a57906">
<ul class="org-ul">
<li>340 g pasta (of choice)</li>
<li>1 Tbsp olive oil</li>
<li>1 1/2 cups diced red onion</li>
<li>1 Tbsp minced garlic</li>
<li>1 medium bell pepper (finely diced)</li>
<li>2 medium carrots (finely diced)</li>
<li>1 1/2 cups cooked green lentils</li>
<li>700 mL jar marinara sauce</li>
<li>400 g can diced tomatoes</li>
<li>1/2 tsp salt</li>
<li>1/2 tsp black pepper</li>
<li>1/4 cup chopped fresh basil</li>
<li>1/2 cup vegan parmesan</li>
<li>1 1/2 cup shredded vegan mozzarella</li>
</ul>
</div>
</div>

<div id="outline-container-orgbbcd152" class="outline-2">
<h2 id="orgbbcd152">Instructions</h2>
<div class="outline-text-2" id="text-orgbbcd152">
<ol class="org-ol">
<li>Bring a large pot of salted water to a boil and cook pasta according to package instructions.</li>
<li>Preheat the oven to 220&deg;C.</li>
<li>Add the oil to a skillet and heat over medium heat.</li>
<li>Add in the diced onion and saute for about 5-7 minutes, until translucent.</li>
<li>Add in the garlic, diced pepper and carrots.</li>
<li>Saute for an additional 5 or so minutes.</li>
<li>Add in the lentils, diced tomatoes, marinara, salt, and pepper.</li>
<li>Stir in the cooked pasta, basil, and parmesan. Mix well to combine.</li>
<li>Transfer to a large casserole or baking dish.</li>
<li>Top with the mozzarella and bake, uncovered, for 20-25 minutes or until the cheese is melted.</li>
<li>Enjoy!</li>
</ol>
</div>
</div>
</div>
</body>
</html>
